Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType Class
 The PropertyElementType class represents the type of a property element.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PropertyElementType : IIsEqual
<SerializableAttribute>
Public Class PropertyElementType
	Implements IIsEqual
The PropertyElement.PropertyElementType type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace